hansonfang/esp8266-ai/firmware/src/main.cpp
// ESP8266 WiFi clock: shows local time plus live Claude Code / Codex CLI
// working status and usage quota, polled from a small bridge service that
// runs on the developer's Mac (see ../bridge/bridge.py).
//
// Display: 240x240 SPI ST7789 (TFT_eSPI). Pin mapping is set via build_flags
// in platformio.ini - edit those if your wiring differs.

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>

#include "config.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"

TFT_eSPI tft = TFT_eSPI();
ESP8266WebServer webServer(80);

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude or
// /sprite/codex (the device serves its own upload page at "/"); the ESP8266
// decodes and rescales the GIF *on-device* (AnimatedGIF, line-by-line so it
// never needs a full-canvas buffer) into the compact SP8 format:
//   ["SP8"][1 byte frame count][RGB332 frame0][RGB332 frame1]...
// A complete nine-state Codex pet uses AIPET1 instead; both formats are
// expanded one row at a time to the display's RGB565 wire order.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const char *CODEX_PET_FILE = "/codex.pet";
const char *CODEX_PET_TEMP_FILE = "/codex.tmp";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;
const size_t CLAUDE_FRAME_BYTES_332 = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H;
const size_t CODEX_FRAME_BYTES_332 = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H;
const int CODEX_PET_W = 144, CODEX_PET_H = 144;
const size_t CODEX_PET_FRAME_BYTES_332 = (size_t)CODEX_PET_W * CODEX_PET_H;
const size_t AIPET_HEADER_BYTES = 128;
const size_t CODEX_PET_DEVICE_BYTES = AIPET_HEADER_BYTES + (size_t)57 * CODEX_PET_FRAME_BYTES_332;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers, which wouldn't fit alongside a static
// full-frame buffer (a 120x120 frame is ~28KB) on the ESP8266's ~80KB. So both
// the display path and the decoder work one screen-row at a time through these
// two small scratch rows (SCREEN_W is the widest we ever need).
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t scaledRowBuf[SCREEN_W]; // one nearest-neighbor-expanded sprite row
uint8_t sprite8Row[SCREEN_W];
uint8_t prevSprite8Row[SCREEN_W];

bool claudeCustom = false;
int claudeCustomFrames = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
bool codexPetCustom = false;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

enum PetState { PET_IDLE, PET_RUNNING_RIGHT, PET_RUNNING_LEFT, PET_WAVING, PET_JUMPING,
                PET_FAILED, PET_WAITING, PET_RUNNING, PET_REVIEW, PET_STATE_COUNT };
struct PetStateMeta { uint8_t frames; uint16_t delayMs; uint32_t offset; uint32_t length; };
PetStateMeta codexPetStates[PET_STATE_COUNT];
PetState codexPetState = PET_IDLE;
PetState petStateOverride = PET_IDLE;
unsigned long petStateOverrideDeadlineMs = 0;

const int SCREEN_CX = 120, SCREEN_CY = 120;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const int SIDEBAR_CX = 44;
const int PET_CX = 151, PET_W = 150;
const unsigned long ANIM_INTERVAL_MS = 120;  // sprite frame advance
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast
const unsigned long SWITCH_IDLE_MS = 6000;   // neither working: alternate slow

enum ActiveApp { APP_CLAUDE, APP_CODEX };
ActiveApp currentApp = APP_CLAUDE;
unsigned long lastSwitchMs = 0;

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// net/music = show Mac-side telemetry pages instead of the pet.
enum DisplayMode { MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_NET, MODE_MUSIC, MODE_STOCK };
DisplayMode displayMode = MODE_AUTO;

const char *displayModeName(DisplayMode mode) {
  if (mode == MODE_CLAUDE) return "claude";
  if (mode == MODE_CODEX) return "codex";
  if (mode == MODE_NET) return "net";
  if (mode == MODE_MUSIC) return "music";
  if (mode == MODE_STOCK) return "stock";
  return "auto";
}

bool parseDisplayMode(const String &name, DisplayMode &mode) {
  if (name == "auto") mode = MODE_AUTO;
  else if (name == "claude") mode = MODE_CLAUDE;
  else if (name == "codex") mode = MODE_CODEX;
  else if (name == "net") mode = MODE_NET;
  else if (name == "music") mode = MODE_MUSIC;
  else if (name == "stock") mode = MODE_STOCK;
  else return false;
  return true;
}

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
int netCpuPct = -1, netMemPct = -1;        // Mac CPU/MEM row; -1 = bridge sends none (hidden)
String netLastCpuVal, netLastMemVal;       // change detection for the CPU/MEM values
bool netSysLabelsDrawn = false;
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
const int MUSIC_TEXT_W = 232;
const int MUSIC_TEXT_H = 44;
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
// ---------- stock watchlist mode state ----------
// Rows come pre-formatted from the bridge (GET /stock or serial #STOCK):
// ASCII code + price/pct strings + up flag, so the firmware just paints.
const unsigned long STOCK_POLL_INTERVAL_MS = 5000;
const int MAX_STOCKS = 4;
struct StockRow {
  String code, price, pct;
  int up = 0; // 1 rising (red, CN convention) / -1 falling (green) / 0 flat
};
