hansonfang/esp8266-ai/firmware/src/main.cpp
  codexCustom = false;
  if (LittleFS.exists(CODEX_SPRITE_FILE)) {
    File f = LittleFS.open(CODEX_SPRITE_FILE, "r");
    if (f && f.size() >= 4) {
      char magic[3]; f.readBytes(magic, 3); uint8_t cnt = f.read();
      size_t expected = 4 + (size_t)cnt * CODEX_FRAME_BYTES_332;
      if (!memcmp(magic, "SP8", 3) && cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        codexCustom = true;
        codexCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

  loadCodexPetFile(CODEX_PET_FILE);

  Serial.printf("[sprite] claude custom=%d frames=%d | codex custom=%d frames=%d pet=%d\n", claudeCustom,
                claudeCustomFrames, codexCustom, codexCustomFrames, codexPetCustom);
}

int claudeFrameCount() { return claudeCustom ? claudeCustomFrames : CLAUDE_SPRITE_FRAMES; }
int codexFrameCount() {
  if (codexPetCustom) return codexPetStates[codexPetState].frames;
  return codexCustom ? codexCustomFrames : CODEX_SPRITE_FRAMES;
}

// Draws one sprite frame in the right-hand pet pane. Each source row is
// expanded with nearest-neighbor scaling, so the animation remains crisp
// without needing a full-frame buffer.
void drawScaledSpriteRow(int x0, int y, int dstW, int srcW) {
  for (int x = 0; x < dstW; x++) scaledRowBuf[x] = rowBuf[x * srcW / dstW];
  tft.pushImage(x0, y, dstW, 1, scaledRowBuf);
}

void drawSpriteFrame(bool custom, const char *file, const uint16_t *const *progmemFrames, int frameIdx, int w,
                     int h, size_t frameBytes) {
  int dstW = PET_W, dstH = h * PET_W / w;
  int x0 = PET_CX - dstW / 2, y0 = SCREEN_CY - dstH / 2;
  size_t rowBytes = (size_t)w * 2;
  if (custom) {
    File f = LittleFS.open(file, "r");
    if (!f) return;
    size_t frameBytes332 = (size_t)w * h;
    int sourceRow = -1;
    for (int r = 0; r < dstH; r++) {
      int srcY = r * h / dstH;
      if (srcY != sourceRow) {
        sourceRow = srcY;
        f.seek(4 + (size_t)frameIdx * frameBytes332 + (size_t)srcY * w);
        f.read(sprite8Row, w);
      }
      for (int x = 0; x < w; x++) rowBuf[x] = rgb332ToWire(sprite8Row[x]);
      drawScaledSpriteRow(x0, y0 + r, dstW, w);
    }
    f.close();
  } else {
    const uint16_t *frame = progmemFrames[frameIdx];
    for (int r = 0; r < dstH; r++) {
      int srcY = r * h / dstH;
      memcpy_P(rowBuf, frame + (size_t)srcY * w, rowBytes);
      drawScaledSpriteRow(x0, y0 + r, dstW, w);
    }
  }
}

// ---------- helpers ----------

String formatTokens(long tokens) {
  if (tokens >= 1000000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fM", tokens / 1000000.0);
    return String(buf);
  }
  if (tokens >= 1000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fk", tokens / 1000.0);
    return String(buf);
  }
  return String(tokens);
}

// ---------- drawing ----------

void drawStaticChrome() {
  tft.fillScreen(TFT_BLACK);
}

// Bridge unreachable / data stale -> flashing red overrides everything else,
// matches the "urgent, look now" state from the reference signal-light design.
bool bridgeStale() {
  if (!everPolled) return true;
  return (millis() - lastSuccessMs) >= 2UL * BRIDGE_POLL_INTERVAL_MS;
}

bool agentEventActive() {
  return agentEvent != EVENT_NONE && (long)(millis() - agentEventDeadlineMs) < 0;
}

const char *agentEventLabel() {
  switch (agentEvent) {
    case EVENT_THINKING: return "THINK";
    case EVENT_TOOL_RUNNING: return "TOOL";
    case EVENT_REVIEWING: return "REVIEW";
    case EVENT_SUCCESS: return "DONE";
    case EVENT_FAILURE: return "FAIL";
    case EVENT_ATTENTION: return "INPUT";
    default: return "";
  }
}

uint16_t agentEventColor() {
  switch (agentEvent) {
    case EVENT_THINKING: return TFT_CYAN;
    case EVENT_REVIEWING: return TFT_ORANGE;
    case EVENT_FAILURE: return TFT_RED;
    case EVENT_ATTENTION: return TFT_RED;
    default: return TFT_GREEN;
  }
}

bool setAgentEvent(const char *name, int ttlMs) {
  if (!strcmp(name, "thinking")) agentEvent = EVENT_THINKING;
  else if (!strcmp(name, "tool-running")) agentEvent = EVENT_TOOL_RUNNING;
  else if (!strcmp(name, "reviewing")) agentEvent = EVENT_REVIEWING;
  else if (!strcmp(name, "success")) agentEvent = EVENT_SUCCESS;
  else if (!strcmp(name, "failure")) agentEvent = EVENT_FAILURE;
  else if (!strcmp(name, "attention")) agentEvent = EVENT_ATTENTION;
  else return false;
  agentEventDeadlineMs = millis() + constrain(ttlMs, 250, 600000);
  return true;
}

const char *petStateName(PetState state) {
  static const char *names[PET_STATE_COUNT] = { "idle", "running-right", "running-left", "waving", "jumping",
                                                "failed", "waiting", "running", "review" };
  return names[state];
}

bool parsePetState(const String &name, PetState &state) {
  for (int i = 0; i < PET_STATE_COUNT; i++) {
    if (name == petStateName((PetState)i)) { state = (PetState)i; return true; }
  }
  return false;
}

bool petStateOverrideActive() {
  return (long)(millis() - petStateOverrideDeadlineMs) < 0;
}

PetState desiredCodexPetState() {
  if (petStateOverrideActive()) return petStateOverride;
  if (codexStatus.needsInput) return PET_WAITING;
  if (agentEventActive()) {
    if (agentEvent == EVENT_ATTENTION) return PET_WAITING;
    if (agentEvent == EVENT_REVIEWING) return PET_REVIEW;
    if (agentEvent == EVENT_FAILURE) return PET_FAILED;
    if (agentEvent == EVENT_SUCCESS) return PET_JUMPING;
    if (agentEvent == EVENT_THINKING || agentEvent == EVENT_TOOL_RUNNING) return PET_RUNNING;
  }
  PetState bridgeState;
  if (parsePetState(codexStatus.petState, bridgeState)) return bridgeState;
  return codexStatus.status == "working" ? PET_RUNNING : PET_IDLE;
}

// True when the app currently on screen is waiting on a permission/approval
// prompt — drives the red "look now, act" border flash.
bool currentAppNeedsInput() {
  if (currentApp == APP_CLAUDE) return claudeStatus.needsInput;
  return agentEventActive() && agentEvent == EVENT_ATTENTION;
}

// The quota ring doubles as a status light. Idle is the only steady state;
// every other state flashes in its semantic color while retaining the quota
// percentage as the illuminated length.
uint16_t codexStateColor(PetState state) {
  switch (state) {
    case PET_FAILED: return TFT_RED;
    case PET_WAITING: return TFT_GREEN;
    case PET_REVIEW: return TFT_ORANGE;
    case PET_WAVING: return TFT_YELLOW;
    case PET_RUNNING:
    case PET_RUNNING_LEFT:
    case PET_RUNNING_RIGHT: return TFT_CYAN;
    default: return TFT_GREEN; // idle and successful jumping
  }
}

bool currentStatusFlashes() {
  if (currentAppNeedsInput() || (everPolled && bridgeStale())) return true;
  if (currentApp == APP_CODEX) {
    if (agentEventActive()) return true;
    PetState state = desiredCodexPetState();
    return state != PET_IDLE && state != PET_WAITING;
  }
  return claudeStatus.status == "working" || claudeStatus.status == "waiting" ||
         claudeStatus.status == "offline";
}

uint16_t currentStatusBaseColor() {
  if (currentAppNeedsInput() || (everPolled && bridgeStale())) return TFT_RED;
  if (currentApp == APP_CODEX) {
    if (agentEventActive()) return agentEventColor();
    return codexStateColor(desiredCodexPetState());
  }
  if (claudeStatus.status == "working") return TFT_CYAN;
  if (claudeStatus.status == "waiting") return TFT_RED;
  if (claudeStatus.status == "offline") return TFT_RED;
  return TFT_GREEN;
}

uint16_t currentStatusColor() {
  if (currentStatusFlashes() && !flashOn) return TFT_BLACK;
  return currentStatusBaseColor();
}

// The ring is skipped when nothing changed (see drawSquareRing) so the 5s
// poll doesn't visibly blank-and-repaint it. Anything that paints over the
// ring area must invalidate this cache.
float ringLastPct = -1000;
uint16_t ringLastColor = 1;

