hansonfang/esp8266-ai/firmware/src/main.cpp
void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    if (parseStatusJson(payload)) {
      lastSuccessMs = millis();
      everPolled = true;
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    claudeStatus.status = "offline";
    codexStatus.status = "offline";
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (updateActiveApp()) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- wired (USB serial) bridge link ----------
// Fallback for WiFi networks with client isolation (device can't reach the
// bridge over LAN) - or for skipping WiFi setup entirely: when the clock is
// plugged into the computer over USB, the bridge pushes the same /status and
// /net payloads down the CH340 serial line as newline-terminated frames:
//   bridge -> device:  #HELLO   #STATUS {json}   #NET {json}   #CMD {json}
//   device -> bridge:  #DEVICE {"name":"aiclock","fw":"x.y.z"}
// Everything else the device prints (logs) is ignored by the bridge.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600]; // biggest frame is #STATUS at ~600 bytes
size_t serialLineLen = 0;
File serialPetFile;
bool serialPetUploading = false;
uint32_t serialPetExpectedBytes = 0;
uint32_t serialPetReceivedBytes = 0;
uint32_t serialPetExpectedCRC = 0;
uint32_t serialPetCRC = 0xFFFFFFFFUL;
int serialPetNextSeq = 0;
uint8_t serialPetChunk[768];

bool wiredActive() { return wiredEverLinked && (millis() - lastSerialFrameMs) < 15000UL; }

void serialAck(int id, bool ok, const char *error = nullptr) {
  if (id < 0) return; // keep the old one-way bridge protocol compatible
  JsonDocument doc;
  doc["id"] = id;
  doc["ok"] = ok;
  doc["brightness"] = brightness;
  doc["screen_on"] = screenOn;
  doc["display"] = displayModeName(displayMode);
  if (agentEventActive()) doc["event"] = agentEventLabel();
  if (error) doc["error"] = error;
  Serial.print("#ACK ");
  serializeJson(doc, Serial);
  Serial.println();
}

void serialInfo(int id) {
  JsonDocument doc;
  doc["id"] = id;
  doc["brightness"] = brightness;
  doc["screen_on"] = screenOn;
  doc["display"] = displayModeName(displayMode);
  doc["effective"] = displayModeName(effectiveMode());
  doc["wired"] = wiredActive();
  doc["fw"] = FW_VERSION;
  doc["custom_pet"] = codexPetCustom;
  doc["pet_state"] = petStateName(codexPetState);
  Serial.print("#INFO ");
  serializeJson(doc, Serial);
  Serial.println();
}

void abortSerialPetUpload() {
  if (serialPetFile) serialPetFile.close();
  serialPetUploading = false;
  serialPetExpectedBytes = 0;
  serialPetReceivedBytes = 0;
  serialPetNextSeq = 0;
  LittleFS.remove(CODEX_PET_TEMP_FILE);
}

int base64Value(char c) {
  if (c >= 'A' && c <= 'Z') return c - 'A';
  if (c >= 'a' && c <= 'z') return c - 'a' + 26;
  if (c >= '0' && c <= '9') return c - '0' + 52;
  if (c == '+') return 62;
  if (c == '/') return 63;
  return -1;
}

int decodeBase64Chunk(const char *src, uint8_t *dst, size_t capacity) {
  size_t len = strlen(src);
  if (len == 0 || len % 4 != 0) return -1;
  size_t out = 0;
  for (size_t i = 0; i < len; i += 4) {
    int a = base64Value(src[i]);
    int b = base64Value(src[i + 1]);
    int c = src[i + 2] == '=' ? -2 : base64Value(src[i + 2]);
    int d = src[i + 3] == '=' ? -2 : base64Value(src[i + 3]);
    if (a < 0 || b < 0 || c == -1 || d == -1 || (c == -2 && d != -2) ||
        ((c == -2 || d == -2) && i + 4 != len)) return -1;
    if (out >= capacity) return -1;
    dst[out++] = (uint8_t)((a << 2) | (b >> 4));
    if (c != -2) {
      if (out >= capacity) return -1;
      dst[out++] = (uint8_t)((b << 4) | (c >> 2));
    }
    if (d != -2) {
      if (out >= capacity) return -1;
      dst[out++] = (uint8_t)((c << 6) | d);
    }
  }
  return (int)out;
}

bool installCodexPetTemp(String &error) {
  if (!loadCodexPetFile(CODEX_PET_TEMP_FILE)) {
    LittleFS.remove(CODEX_PET_TEMP_FILE);
    codexPetCustom = false;
    error = "invalid AIPET1";
    return false;
  }
  codexPetCustom = false;
  LittleFS.remove(CODEX_PET_FILE);
  if (!LittleFS.rename(CODEX_PET_TEMP_FILE, CODEX_PET_FILE) || !loadCodexPetFile(CODEX_PET_FILE)) {
    LittleFS.remove(CODEX_PET_TEMP_FILE);
    LittleFS.remove(CODEX_PET_FILE);
    codexPetCustom = false;
    error = "install failed";
    return false;
  }
  LittleFS.remove(CODEX_SPRITE_FILE);
  codexCustom = false;
  codexCustomFrames = 0;
  codexPetState = desiredCodexPetState();
  codexFrame = 0;
  spriteRev++;
  if (currentApp == APP_CODEX) drawActiveApp();
  return true;
}

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6)) {
    Serial.printf("#DEVICE {\"name\":\"aiclock\",\"fw\":\"%s\",\"protocol\":3}\n", FW_VERSION);
    return;
  }
  if (!strncmp(line, "#INFO? ", 7)) {
    JsonDocument doc;
    if (!deserializeJson(doc, line + 7) && doc["id"].is<int>()) serialInfo(doc["id"].as<int>());
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    if (parseStatusJson(String(line + 8))) {
      lastSuccessMs = millis();
      everPolled = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK) {
        if (updateActiveApp()) drawActiveApp();
        else refreshActiveApp();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#STOCK ", 7)) {
    handleStockPayload(String(line + 7));
    return;
  }
  if (!strncmp(line, "#PET_BEGIN ", 11)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 11)) return;
    int id = doc["id"] | -1;
    uint32_t bytes = doc["bytes"] | 0;
    if (!doc["crc32"].is<uint32_t>()) { serialAck(id, false, "invalid pet checksum"); return; }
    uint32_t crc = doc["crc32"].as<uint32_t>();
    if (bytes != CODEX_PET_DEVICE_BYTES) { serialAck(id, false, "invalid pet size"); return; }
    abortSerialPetUpload();
    LittleFS.remove(CODEX_PET_FILE);
    LittleFS.remove(CODEX_SPRITE_FILE);
    codexPetCustom = false;
    codexCustom = false;
    serialPetFile = LittleFS.open(CODEX_PET_TEMP_FILE, "w");
    if (!serialPetFile) { serialAck(id, false, "storage open failed"); return; }
    serialPetUploading = true;
    serialPetExpectedBytes = bytes;
    serialPetReceivedBytes = 0;
    serialPetExpectedCRC = crc;
    serialPetCRC = 0xFFFFFFFFUL;
    serialPetNextSeq = 0;
    serialAck(id, true);
    return;
  }
  if (!strncmp(line, "#PET_CHUNK ", 11)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 11)) return;
    int id = doc["id"] | -1;
    int seq = doc["seq"] | -1;
    const char *encoded = doc["data"] | (const char *)nullptr;
    if (!serialPetUploading || !encoded) { serialAck(id, false, "no pet upload"); return; }
    if (seq != serialPetNextSeq) { abortSerialPetUpload(); serialAck(id, false, "bad chunk sequence"); return; }
    int decoded = decodeBase64Chunk(encoded, serialPetChunk, sizeof(serialPetChunk));
    if (decoded <= 0 || serialPetReceivedBytes + decoded > serialPetExpectedBytes ||
        serialPetFile.write(serialPetChunk, decoded) != (size_t)decoded) {
      abortSerialPetUpload(); serialAck(id, false, "chunk write failed"); return;
    }
    serialPetCRC = crc32Update(serialPetCRC, serialPetChunk, decoded);
    serialPetReceivedBytes += decoded;
    serialPetNextSeq++;
    serialAck(id, true);
    return;
  }
  if (!strncmp(line, "#PET_END ", 9)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 9)) return;
    int id = doc["id"] | -1;
    if (!serialPetUploading) { serialAck(id, false, "no pet upload"); return; }
    serialPetFile.close();
    serialPetUploading = false;
    if (serialPetReceivedBytes != serialPetExpectedBytes ||
        (serialPetCRC ^ 0xFFFFFFFFUL) != serialPetExpectedCRC) {
      uint32_t actualCRC = serialPetCRC ^ 0xFFFFFFFFUL;
      char detail[96];
      snprintf(detail, sizeof(detail), "pet checksum failed (expected %08lx, got %08lx)",
               (unsigned long)serialPetExpectedCRC, (unsigned long)actualCRC);
      abortSerialPetUpload(); serialAck(id, false, detail); return;
    }
    String error;
    bool ok = installCodexPetTemp(error);
    serialAck(id, ok, ok ? nullptr : error.c_str());
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    int id = doc["id"].is<int>() ? doc["id"].as<int>() : -1;
    bool changed = false;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
      changed = true;
    }
    const char *screen = doc["screen"] | (const char *)nullptr;
    if (screen) {
      if (!strcmp(screen, "on")) screenOn = true;
      else if (!strcmp(screen, "off")) screenOn = false;
      else { serialAck(id, false, "invalid screen"); return; }
      applyBrightness();
      changed = true;
    }
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      DisplayMode requestedMode;
      if (!parseDisplayMode(String(mode), requestedMode)) {
        serialAck(id, false, "invalid display");
        return;
      }
      if (displayMode != requestedMode) {
        displayMode = requestedMode;
        saveDisplayMode();
      }
      changed = true;
      // the effectiveMode transition handler in loop() repaints the chrome
    }
    const char *event = doc["event"] | (const char *)nullptr;
    if (event) {
      if (!setAgentEvent(event, doc["ttl_ms"] | 4000)) { serialAck(id, false, "invalid event"); return; }
      changed = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK) {
        updateActiveApp();
        drawActiveApp();
      }
    }
    if (doc["pet_reset"] | false) {
      abortSerialPetUpload();
      LittleFS.remove(CODEX_PET_FILE);
      LittleFS.remove(CODEX_SPRITE_FILE);
      loadCustomSpriteState();
      codexFrame = 0;
      spriteRev++;
      if (currentApp == APP_CODEX) drawActiveApp();
      changed = true;
    }
    serialAck(id, changed, changed ? nullptr : "empty command");
    return;
  }
}

